# pandasによるデータ処理1

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## 練習問題1

以下のようなシリーズを作れ。

prefecture <br>
Fukuoka      5107 <br>
Saga          819 <br>
Nagasaki     1341 <br>
Kumamoto     1757 <br>
Oita         1144 <br>
Miyazaki     1081 <br>
Kagoshima    1614 <br>
Name: population, dtype: int64

In [4]:
prefecture = pd.Series([5107, 819, 1341, 1757, 1144, 1081, 1614], index=['Fukuoka', 'Saga', 'Nagasaki', 'Kumamoto', 'Oita', 'Miyazaki', 'Kagoshima'])

prefecture.name = 'population'
prefecture.index.name = 'prefecture'

prefecture

prefecture
Fukuoka      5107
Saga          819
Nagasaki     1341
Kumamoto     1757
Oita         1144
Miyazaki     1081
Kagoshima    1614
Name: population, dtype: int64

## 練習問題2

以下のようなデータフレームを作れ。

<table>
    <tr>
        <th></th>
        <th>Fukuoka</th>
        <th>Saga</th>
        <th>Nagasaki</th>
        <th>Kumamoto</th>
        <th>Oita</th>
        <th>Miyazaki</th>
        <th>Kagoshima</th>
    </tr>
    <tr>
        <th>pop</th>
        <td>5107.0</td>
        <td>819.0</td>
        <td>1341.0</td>
        <td>1757.0</td>
        <td>1144.0</td>
        <td>1081.0</td>
        <td>1614.0</td>
    </tr>
    <tr>
        <th>sr</th>
        <td>89.8</td>
        <td>89.8</td>
        <td>88.8</td>
        <td>89.4</td>
        <td>90.0</td>
        <td>88.9</td>
        <td>88.6</td>
    </tr>
    <tr>
        <th>idr</th>
        <td>0.1</td>
        <td>-5.5</td>
        <td>-9.9</td>
        <td>-4.8</td>
        <td>-7.5</td>
        <td>-7.4</td>
        <td>-7.0</td>
    </tr>
</table>

In [1]:
data = {'Fukuoka': [5107.0, 89.8, 0.1], \
       'Saga': [819.0, 89.8, -5.5], \
       'Nagasaki': [1341.0, 88.8, -9.9], \
       'Kumamoto': [1757.0, 89.4, -4.8], \
       'Oita': [1144.0, 90.0, -7.5], \
       'Miyazaki': [1081.0, 88.9, -7.4], \
       'Kagoshima': [1614.0, 88.6, -7.0]}
frame = pd.DataFrame(data, index=['pop', 'sr', 'idr'])
frame

NameError: name 'pd' is not defined

## 練習問題3

上記のframeにおいて、以下のように再インデックス付けせよ。

<table>
    <tr>
        <th></th>
        <th>California</th>
        <th>Ohio</th>
        <th>Washington</th>
    </tr>
    <tr>
        <th>a</th>
        <td>2.0</td>
        <td>0.0</td>
        <td>NaN</td>
    </tr>
    <tr>
        <th>c</th>
        <td>5.0</td>
        <td>3.0</td>
        <td>NaN</td>
    </tr>
    <tr>
        <th>d</th>
        <td>8.0</td>
        <td>6.0</td>
        <td>NaN</td>
    </tr>
    <tr>
        <th>x</th>
        <td>NaN</td>
        <td>NaN</td>
        <td>NaN</td>
    </tr>
</table>

In [8]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
states = ['California', 'Ohio', 'Washington']

frame.reindex(index=['a', 'c', 'd', 'x'], columns=states)

   California  Ohio  Washington
a         2.0   0.0         NaN
c         5.0   3.0         NaN
d         8.0   6.0         NaN
x         NaN   NaN         NaN

## 練習問題4

上記のデータフレームdataにおいて、以下のように軸を削除せよ。

<table>
    <tr>
        <th></th>
        <th>one</th>
        <th>three</th>
        <th>four</th>
    </tr>
    <tr>
        <th>Ohio</th>
        <td>0</td>
        <td>2</td>
        <td>3</td>
    </tr>
    <tr>
        <th>New York</th>
        <td>12</td>
        <td>14</td>
        <td>15</td>
    </tr>
</table>

In [13]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Utah'], inplace=True)
data.drop('two', axis=1, inplace=True)
data

          one  three  four
Ohio        0      2     3
New York   12     14    15

## 練習問題5

In [15]:
ser = pd.Series(np.arange(10), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
ser[['d', 'g', 'a', 'c']]

d    3
g    6
a    0
c    2
dtype: int32

## 練習問題6

上記のデータフレームdataにおいて、以下のようにデータを抽出せよ。

<table>
    <tr>
        <th></th>
        <th>four</th>
        <th>two</th>
        <th>three</th>
    </tr>
    <tr>
        <th>Ohio</th>
        <td>0</td>
        <td>0</td>
        <td>0</td>
    </tr>
    <tr>
        <th>New York</th>
        <td>15</td>
        <td>13</td>
        <td>14</td>
    </tr>
</table>

In [26]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data[data<5] = 0
data.loc[['Ohio', 'New York'], ['four', 'two', 'three']]
# data.iloc[[0,3], [3,1,2]][data>4]

          four  two  three
Ohio         0    0      0
New York    15   13     14

## 練習問題7

上記のdf1とdf2に対し、欠損値を1としたうえで要素ごとの積を取ったデータフレームを求めよ。

In [31]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [32]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [33]:
df1.mul(df2, fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0  30.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

## 練習問題8

df = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd')) <br>
に対し、以下の数列をシリーズとして定義したうえで行方向にブロードキャストで加算せよ。<br>

-6.0 3.0 -5.0 1.0

In [3]:
df = pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [4]:
series = np.array([-6.0, 3.0, -5.0, 1.0])
df + series

     a     b    c     d
0 -6.0   4.0 -3.0   4.0
1 -2.0   8.0  1.0   8.0
2  2.0  12.0  5.0  12.0

## 練習問題9

ランダムな10×5の値からなるデータフレームを作り、各要素が正なら1, そうでなければ0としたデータフレームを求めよ。

In [41]:
frame = pd.DataFrame(np.random.randn(10,5))
frame

          0         1         2         3         4
0  1.415325 -1.131875 -1.409005  1.267674 -0.961091
1  0.883477 -0.066602 -0.811387 -0.548533 -1.539021
2 -0.484697  1.162064 -0.530077 -0.867371  0.509513
3  0.165652 -0.731525 -0.042654  0.824744 -0.068007
4 -2.903972  0.680239 -0.673553 -0.023256  0.434758
5 -0.388562 -1.196077 -0.766153 -0.799548  0.286530
6 -0.735113  0.837132  1.277997  0.086898 -0.737999
7  0.250116  0.198497 -0.170336 -0.795301  0.448445
8 -1.168200 -1.485702  1.573069  0.429154 -1.515046
9 -1.170014 -0.727280  1.170811  0.163698  1.306646

In [42]:
f = lambda x: 1*(x>0)
frame.apply(f)

   0  1  2  3  4
0  1  0  0  1  0
1  1  0  0  0  0
2  0  1  0  0  1
3  1  0  0  1  0
4  0  1  0  0  1
5  0  0  0  0  1
6  0  1  1  1  0
7  1  1  0  0  1
8  0  0  1  1  0
9  0  0  1  1  1